Revit 2026 API

# FilteredWorksetIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Workset Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As Workset
	Get
```
```cpp
public:
virtual property Workset^ Current {
	Workset^ get ();
}
```
```fsharp
abstract Current : Workset with get
override Current : Workset with get
```

#### Property Value

Workset

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

FilteredWorksetIterator Class

Autodesk.Revit.DB Namespace